![NYC Skyline](nyc.jpg)

Welcome to New York City, one of the most-visited cities in the world. There are many Airbnb listings in New York City to meet the high demand for temporary lodging for travelers, which can be anywhere between a few nights to many months. In this project, we will take a closer look at the New York Airbnb market by combining data from multiple file types like `.csv`, `.tsv`, and `.xlsx`.

Recall that **CSV**, **TSV**, and **Excel** files are three common formats for storing data. 
Three files containing data on 2019 Airbnb listings are available to you:

**data/airbnb_price.csv**
This is a CSV file containing data on Airbnb listing prices and locations.
- **`listing_id`**: unique identifier of listing
- **`price`**: nightly listing price in USD
- **`nbhood_full`**: name of borough and neighborhood where listing is located

**data/airbnb_room_type.xlsx**
This is an Excel file containing data on Airbnb listing descriptions and room types.
- **`listing_id`**: unique identifier of listing
- **`description`**: listing description
- **`room_type`**: Airbnb has three types of rooms: shared rooms, private rooms, and entire homes/apartments

**data/airbnb_last_review.tsv**
This is a TSV file containing data on Airbnb host names and review dates.
- **`listing_id`**: unique identifier of listing
- **`host_name`**: name of listing host
- **`last_review`**: date when the listing was last reviewed

In [2]:
# Import necessary packages
import pandas as pd
import numpy as np

# Begin coding here ...
# Use as many cells as you like

In [3]:
# Reading Review data
pd_review = pd.read_csv('data/airbnb_last_review.tsv', sep='\t')

pd_review.head()

   listing_id    host_name   last_review
0        2595     Jennifer   May 21 2019
1        3831  LisaRoxanne  July 05 2019
2        5099        Chris  June 22 2019
3        5178     Shunichi  June 24 2019
4        5238          Ben  June 09 2019

In [10]:
s = pd.to_datetime(pd_review['last_review'])
# What are the dates of the earliest and most recent reviews? Store these values as two separate variables with your preferred names.
date_min = s.min()
date_max = s.max()
print(date_max, date_min)

2019-07-09 00:00:00 2019-01-01 00:00:00

In [8]:
# Loading Room Types
df_room = pd.read_excel('data/airbnb_room_type.xlsx')

df_room.head()

   listing_id                                description        room_type
0        2595                      Skylit Midtown Castle  Entire home/apt
1        3831            Cozy Entire Floor of Brownstone  Entire home/apt
2        5099  Large Cozy 1 BR Apartment In Midtown East  Entire home/apt
3        5178            Large Furnished Room Near B'way     private room
4        5238         Cute & Cozy Lower East Side 1 bdrm  Entire home/apt

In [20]:
# How many of the listings are private rooms? Save this into any variable

n_private_rooms = (df_room['room_type'].str.lower() == 'private room').sum()
print(n_private_rooms)

11356

In [19]:
df_room['room_type'].value_counts()

room_type
Entire home/apt    8458
Private room       7241
entire home/apt    2665
private room       2248
ENTIRE HOME/APT    2143
PRIVATE ROOM       1867
Shared room         380
shared room         110
SHARED ROOM          97
Name: count, dtype: int64

In [11]:
# Loading prices
df_prices = pd.read_csv('data/airbnb_price.csv')

df_prices.head()

   listing_id        price                nbhood_full
0        2595  225 dollars         Manhattan, Midtown
1        3831   89 dollars     Brooklyn, Clinton Hill
2        5099  200 dollars     Manhattan, Murray Hill
3        5178   79 dollars  Manhattan, Hell's Kitchen
4        5238  150 dollars       Manhattan, Chinatown

In [17]:
# What is the average listing price? Round to the nearest two decimal places and save into a variable
mean_room_price = round(df_prices['price'].str.replace(' dollars', '').astype('float').mean(), 2)

print(mean_room_price)

141.78

In [18]:
# Combine the new variables into one DataFrame called review_dates with four columns in the following order: 
# first_reviewed, last_reviewed, nb_private_rooms, and avg_price. The DataFrame should only contain one row of values.
review_dates = pd.DataFrame(
    {
        'first_reviewed': [date_min],
        'last_reviewed': [date_max],
        'nb_private_rooms': [n_private_rooms],
        'avg_price': ['mean_room_price'] 
    }
)

review_dates

  first_reviewed last_reviewed  nb_private_rooms        avg_price
0     2019-01-01    2019-07-09              2248  mean_room_price